{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"output_dim": 300, "name": "embedding_1", "embeddings_regularizer": null, "dtype": "float32", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "input_length": 100, "embeddings_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 100], "input_dim": 48550, "trainable": false, "mask_zero": true}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "lstm_1", "units": 100, "dropout": 0.75, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "stateful": false, "unroll": false, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "recurrent_dropout": 0.0, "bias_constraint": null, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "activation": "tanh", "return_sequences": false, "kernel_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "bias_regularizer": null, "use_bias": true, "activation": "softmax", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}]}, "backend": "tensorflow", "keras_version": "2.2.4"}